In [1]:
import numpy as np
from numpy.random import randn
import pandas as pd
from pandas import Series, DataFrame

In [3]:
ser1 = Series([1, 2, 3 , 4], index = ["A", "B", "C", "D"])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [9]:
ser2 = ser1.reindex(["A", "B", "C", "D", "E", "F"])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [15]:
ser2.reindex(["A", "B", "C", "D", "E", "F", "G"], fill_value = 0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [17]:
ser3 = Series(["USA", "Mexico", "Canada"], index = [0, 5, 10])
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [19]:
ranger = range(15)
ser3.reindex(ranger, method = 'ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [27]:
dframe = DataFrame(randn(25).reshape(5, 5), index = ["A", "B", "D", "E", "F"], columns = ["col1", "col2", "col3", "col4", "col5"])
dframe

       col1      col2      col3      col4      col5
A -0.496062  1.000992 -0.628704  0.312250 -1.160339
B -0.706905 -0.368314  1.753851  1.678624 -0.616465
D -0.892234 -0.288553 -1.024561  0.386833 -0.374927
E  1.528174 -1.168257 -1.733056 -1.491013 -2.502697
F  0.157519  1.403284 -0.649773  1.003569 -0.266126

In [29]:
dframe2 = dframe.reindex(["A", "B", "C", "D", "E", "F"])
dframe2

       col1      col2      col3      col4      col5
A -0.496062  1.000992 -0.628704  0.312250 -1.160339
B -0.706905 -0.368314  1.753851  1.678624 -0.616465
C       NaN       NaN       NaN       NaN       NaN
D -0.892234 -0.288553 -1.024561  0.386833 -0.374927
E  1.528174 -1.168257 -1.733056 -1.491013 -2.502697
F  0.157519  1.403284 -0.649773  1.003569 -0.266126

In [31]:
new_columns = ["col1", "col2", "col3", "col4", "col5", "col6"]

In [33]:
dframe2.reindex(columns = new_columns)

       col1      col2      col3      col4      col5  col6
A -0.496062  1.000992 -0.628704  0.312250 -1.160339   NaN
B -0.706905 -0.368314  1.753851  1.678624 -0.616465   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.892234 -0.288553 -1.024561  0.386833 -0.374927   NaN
E  1.528174 -1.168257 -1.733056 -1.491013 -2.502697   NaN
F  0.157519  1.403284 -0.649773  1.003569 -0.266126   NaN

In [35]:
dframe

       col1      col2      col3      col4      col5
A -0.496062  1.000992 -0.628704  0.312250 -1.160339
B -0.706905 -0.368314  1.753851  1.678624 -0.616465
D -0.892234 -0.288553 -1.024561  0.386833 -0.374927
E  1.528174 -1.168257 -1.733056 -1.491013 -2.502697
F  0.157519  1.403284 -0.649773  1.003569 -0.266126

In [53]:
dframe.reindex(index = ["A", "B", "C", "D", "E", "F"], columns = new_columns)

       col1      col2      col3      col4      col5  col6
A -0.496062  1.000992 -0.628704  0.312250 -1.160339   NaN
B -0.706905 -0.368314  1.753851  1.678624 -0.616465   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.892234 -0.288553 -1.024561  0.386833 -0.374927   NaN
E  1.528174 -1.168257 -1.733056 -1.491013 -2.502697   NaN
F  0.157519  1.403284 -0.649773  1.003569 -0.266126   NaN